{
"About": {
  "Name": "Tracy Mai",
  "Currently": "Computer Science Student",
  "Headshot": "student-portrait.png",
  "Thumbnail": "student-portrait.png",
  "AboutText": "Hi, My name is Tracy Mai. I am a passionate computer science student with a keen interest in software development and programming. Currently, I am pursuing my undergraduate degree at Seattle Pacific University. I am dedicated to expanding my knowledge and skills in various areas of computer science, with a particular focus on C++ programming.<br><br>I enjoy tackling challenging programming projects and I thrive in collaborative environments where I can contribute my expertise and learn from my peers.<br><br>Beyond computer science, I actively engage in extracurricular activites related to my other passions in life such as Pup Support, a mental health organization focused on providing resources for college students. I also believe in continuous learning with the forever growing world of technology."
},
"Contact": {
  "Email": "tracytmai@outlook.com",
  "Phone": "",
  "Portfolio": "https://www.github.com/tracyymaii",
  "LinkedIn": "https://linkedin.com/in/tracy-mai-/",
  "GitHub": "https://www.github.com/tracyymaii"
},
"Experience": {
  "ExperienceText": "Ever since university, I have been creating projects, each one teaching me new skills. Writing new programs and creating things just from typing is one of the greatest joys in my life. I want to continue onto to work in AI bias, to ensure that AI correctly solves human needs without overstepping its boundaries.",
  "School": "Seattle Pacific University",
  "Major": "Computer Science",
  "Graduation": "June 2024",
  "EducationText": "Alongside my major, I am also minoring in Philosophy. Using a human-first perspective, I want to ensure that AI is used and created responsibly in the quick growing world of technology. ",
  "Employment": "Ellipsis Academy",
  "Role": "FlexMath Coach",
  "EmploymentText": "- Educates 12 students 6 hours per week to become innovative problem solvers and critical thinkers through private math sessions for 7-12 year olds upwards to ALgebra 2 whilst accomodating to each students' pace <br><br> - Maintains transparent parent communication through weekly emails, providing students' progress and addressing inquiries",
  "Skills": ["C++", " JavaScript", " Node", " CSS"," HTML", " Java", " Python", " SQLite", " Qt Creator"],
  "SkillsText": "In addition to my current skills, I am also getting certified with Microsoft's AI program.",
  "Resume": "Tracy_Mai_Resume-SPU.pdf"  
},
"Project1": {
    "Title": "Water Tracker - A Computer Application and Pet to Help Meet Hydration Goals",
    "Desc": "Users will meet their hydration goals by taking care of the pet. The more water they drink the more the pet will be happy. <br><br> This team consisted of 3 members and I worked as a full stack software developer.",
    "GitHubRepo": "https://github.com/tracyymaii/Water_Tracker_Computer_App",
    "MainImage": "P1Detail1.png",
    "DetailImages": ["P1Detail1.png", "P1Detail2.png", "P1Detail3.png", "P1Detail4.png"]
  },
  "Project2": {
    "Title": "System Specification - ADA-Friendly Navigation App",
    "Desc": "This navigation app is intended to help physically disabled people traverse through the world.<br><br>This is specification to help developers with building the ADAFNA.",
    "GitHubRepo": "https://drive.google.com/file/d/18d5_EjWLTrofqOiqL5PHKTROvS_U-srA/view",
    "MainImage": "P2Main.png",
    "DetailImages": ["P2Detail1.png","P2Detail2.png","P2Detail3.png","P2Detail4.png"]
  },
  "Project3": {
    "Title": "SEEN - A Bi-Directional American Sign Language APP",
    "Desc": "This app was developed with a team of 5, with the goal of bridging the communication gap between deaf and hearing communities.<br><br>SEEN received the Top Oral Presentation Award at Seattle Pacific University's 2025 Erickson Conference. <br><br>I worked as the scrum master and software developer.",
    "GitHubRepo": "https://github.com/Project-Seen",
    "MainImage": "P3Main.png",
    "DetailImages": ["P3Detail1.png","P3Detail2.png"]
  },
  "Project4": {
    "Title": "Web Crawler",
    "Desc": "A program that calculates various measurements based on a graph built to represent the connection of websites. <br><br> Calculates the All Pairs Shortest Path, Longest Path, Shortest Path, and Closeness Centrality. <br><br>Worked as a software developer in a team of two.",
    "GitHubRepo": "https://github.com/tracyymaii/Web-Crawler",
    "MainImage": "P4Main1.png",
    "DetailImages": []
  },
  "Project5": {
    "Title": "Go -- Lexical and Syntax Analyzer",
    "Desc": "A program that takes in coordinate points and shapes, and categorizes the tokens accordingly. <br><br> This was a solo project.",
    "GitHubRepo": "https://github.com/tracyymaii/Web-Crawler",
    "MainImage": "P5Detail3.png",
    "DetailImages": []
  }
}
